/* Ένα ηλεκτρονικό κατάστημα χρεώνει τις παραγγελίες του ανάλογα με τον προορισμό της παραγγελίας. Ο προορισμός της παραγγελίας καθορίζεται βάσει τoυ Ταχυδρομικού Κώδικα αποστολής και οι
 * χρεώσεις ορίζονται στον παρακάτω πίνακα.
 * 
 *          Ταχ. Κώδικας |	Χρέωση
 *     	 ------------------------------
 *     	   55000 - 59000 |  2.0E
 *         61000 - 66000 |	3.0E
 *     	   40000 - 43000 |	2.5E
 *     'Αλλος προορισμός |	3.5E
 *       
 * Επιπρόσθετα, παραγγελίες άνω των 500 ευρώ πρέπει να ασφαλίζονται σε περίπτωση απώλειας. Το κόστος της ασφάλειας ανέρχεται στο 5% της αξίας της παραγγελίας, με μέγιστο ποσό τα 80 ευρώ.
 * Να γίνει πρόγραμμα που θα διαβάζει την αξία της παραγγελίας, τον ταχυδρομικό κώδικα ]αποστολής και θα εμφανίζει το κόστος αποστολής και το κόστος ασφάλειας (αν δεν υπάρχει εμφανίζεται 0)
 * και το συνολικό κόστος (αξία + αποστολή + ασφάλεια).
 * */
package MyFirstPackage;

import java.util.Scanner;

public class TaxKodikas {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		double A; // Αξία.
		int C; //Ταχυδρομικός Κώδικας.
		float X; //Χρέωση.
		double S = 0; //Ασφάλεια.
		Scanner sc = new Scanner(System.in);
		System.out.println("Υπολογισμός των επιπρόσθετων εξόδων μεταφοράς.");
		System.out.println(" ");
		System.out.println("Εισάγετε την αξία της παραγγελίας.");
		A = sc.nextDouble();
		System.out.println(" ");
		System.out.println("Εισάγετε τον Ταχυδρομικό Κώδικα της περιοχής σας.");
		C = sc.nextInt();
		if(C >= 55000 && C <= 59000) {
			X = 2;
		} //Πρώτη περίπτωση.
		else if(C >= 61000 && C <= 66000) {
			X = 3;
		}
		else if( C >= 40000 && C <= 43000) {
			X = 2.5F;
		}
		else {
			X = 3.5F;
		}
		if(A > 500) {
			S = (5 * A) / 100;
			if(S >= 80){
				S = 80;
			}
		}
		System.out.println(" ");
		System.out.println("Τελικά Στοιχεία της παραγγελίας σας: ");
		System.out.println(" ");
		System.out.println(" ->Καθαρή Αξία: " + A +"Ε");
		System.out.println(" ->Τέλη αποστολής: " + X +"Ε");
		System.out.println(" ->Ασφάλεια:  " + S +"Ε");
		System.out.println(" ->Τελικό πληρωτέο ποσό: "  +(A + X + S) +"Ε");

		sc.close();
	}

}